## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/10210364618)



<pre><code>Plan: 3 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * google_service_account.kyma-compliance-pipeline
  * google_service_account.kyma-security-scanners
  * google_service_account.neighbors-conduit-cli-builder
* Update
  * google_service_account.sa_gke_kyma_integration
  * module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner



<details><summary>Change Result (Click me)</summary>

```hcl

  # google_service_account.kyma-compliance-pipeline will be created
  + resource "google_service_account" "kyma-compliance-pipeline" {
      + account_id   = "kyma-compliance-pipeline"
      + description  = "Service account for retrieving secrets on the compliance Azure pipeline."
      + disabled     = false
      + display_name = "kyma-compliance-pipeline"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.kyma-security-scanners will be created
  + resource "google_service_account" "kyma-security-scanners" {
      + account_id   = "kyma-security-scanners"
      + description  = "Service account for retrieving secrets on the security-scanners and orphan-cleaner Azure pipelines."
      + disabled     = false
      + display_name = "kyma-security-scanners"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.neighbors-conduit-cli-builder will be created
  + resource "google_service_account" "neighbors-conduit-cli-builder" {
      + account_id   = "neighbors-conduit-cli-builder"
      + description  = "Service account for retrieving secrets on the conduit-cli build pipeline."
      + disabled     = false
      + display_name = "neighbors-conduit-cli-builder"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "sap-kyma-prow"
      + unique_id    = (known after apply)
    }

  # google_service_account.sa_gke_kyma_integration will be updated in-place
  ~ resource "google_service_account" "sa_gke_kyma_integration" {
      ~ description  = "Service account is used by Prow to integrate with GKE. Will be removed with Prow" -> "Service account is used by Prow to integrate with GKE."
        id           = "projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com"
        name         = "projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com"
        # (7 unchanged attributes hidden)
    }

  # module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner will be updated in-place
  ~ resource "google_cloud_scheduler_job" "service_account_keys_cleaner" {
        id               = "projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner"
        name             = "service-account-keys-cleaner"
        # (8 unchanged attributes hidden)

      ~ http_target {
          ~ uri         = "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app/?project=sap-kyma-prow&age=24" -> "https://service-account-keys-cleaner-q25ja7ch3q-ez.a.run.app?project=sap-kyma-prow&age=24"
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

Plan: 3 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ artifact_registry                                   = {
      ~ modules-internal = {
          ~ artifact_registry_collection = {
                id                        = "projects/kyma-project/locations/europe/repositories/modules-internal"
                name                      = "modules-internal"
              ~ update_time               = "2024-08-01T09:59:19.804776Z" -> "2024-08-02T04:25:43.697877Z"
                # (18 unchanged attributes hidden)
            }
        }
    }
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry has changed
  ~ resource "google_artifact_registry_repository" "artifact_registry" {
        id                     = "projects/kyma-project/locations/europe/repositories/modules-internal"
        name                   = "modules-internal"
      ~ update_time            = "2024-08-01T09:59:19.804776Z" -> "2024-08-02T04:25:43.697877Z"
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>







<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":11546,"Program":"tfcmt","SHA1":"05f8a9f29f3406abbb2ce468c22512d713316de1","Vars":{},"WorkflowName":"Pull Plan Prod Terraform"} -->